HELYXcore-4.4.0/examples/legacy/multiphase/driftFluxFoam/RAS/mixerVessel2D/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

runApplication ./makeMesh
runApplication $(getApplication)

#------------------------------------------------------------------------------
